// Дано число больше 9. Вывести на экран вторую цифру числа с конца
int num = 1678;
System.Console.WriteLine(num / 10 % 10);